app/workers/counter_worker.rb

SELECT  "conversions".* FROM "conversions" WHERE "conversions"."date" = $1 LIMIT $2  [["date", "2019-01-28"], ["LIMIT", 1]]
INSERT INTO "conversions" ("date", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "2019-01-28"], ["count", 1], ["created_at", "2019-01-28 04:59:31.212235"], ["updated_at", "2019-01-28 04:59:31.212235"]]
UPDATE "conversions" SET "count" = $1, "updated_at" = $2 WHERE "conversions"."id" = $3  [["count", 2], ["updated_at", "2019-01-28 05:00:40.215427"], ["id", 1]]
---
  def perform
    # Do something
    if Conversion.find_by(date: Date.today) == nil
       #count_today = Conversion.create(:date => Date.today , :count => 1)
    	Conversion.create(:date => Date.today , :count => 1)
   	else
      count_today = Conversion.find_by(date: Date.today)
      live_count = count_today.count
      count_today.update(count: live_count + 1)