app/workers/hitcount_worker.rb

SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "urls" SET "count" = $1, "updated_at" = $2 WHERE "urls"."id" = $3  [["count", 1], ["updated_at", "2019-01-29 12:06:29.536589"], ["id", 25]]
UPDATE "urls" SET "count" = $1, "updated_at" = $2 WHERE "urls"."id" = $3  [["count", 5], ["updated_at", "2019-01-28 11:59:47.930886"], ["id", 3]]
---
  def perform(id)
  	puts id
  	url = Url.find(id)
    if url.count == nil
      url.update(count: 1)
    else
    	  	puts 'Hellllllooooooooo'

      current_count = url.count
      url.update(count: current_count + 1)