app/views/urls/show.html.erb

SELECT  "conversions".* FROM "conversions" WHERE "conversions"."date" = $1 LIMIT $2  [["date", "2019-01-29"], ["LIMIT", 1]]
---
  <p> Today's total conversions
  <% @conversion = Conversion.find_by(date: Date.today) %>