app/controllers/urls_controller.rb

SELECT "conversions".* FROM "conversions"
---
  def report
    @conversions = Conversion.all

SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    if session[:user_id] == nil
      redirect_to signup_path
    end
    @url = Url.find(params[:id])

SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["short_url", "02f1ea"], ["LIMIT", 1]]
SELECT  1 AS one FROM "urls" LIMIT $1  [["LIMIT", 1]]
SELECT "urls".* FROM "urls"
---
  def show_long_url
    if session[:user_id] == nil
      redirect_to signup_path
    end
    respond_to do |format|
      #@url = Url.find_by(short_url: params[:url][:short_url])
      @url = Rails.cache.fetch(params[:url][:short_url], expires_in: 15.minutes) do
        Url.where(short_url: params[:url][:short_url]).first
      end
      if @url.present?

INSERT INTO "urls" ("long_url", "url_digest", "domain", "short_url", "created_at", "updated_at", "count") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    if session[:user_id] == nil
      redirect_to signup_path
    end
    @url = Url.new(url_params)
    require 'digest/md5'
    short_domain = params[:url][:domain][0,3]
    @url.url_digest = Digest::MD5.hexdigest(params[:url][:long_url])
    @url.short_url = 'www.' + short_domain + '.com/' + @url.url_digest[0,6]
    @url.count = 0
    respond_to do |format|
      if @url.save