app/controllers/urls_controller.rb

SELECT  "urls".* FROM "urls" LIMIT $1  [["LIMIT", 1]]
---
	def search_result
				@url = Url.search(params[:url][:keyword])

SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def show
		@url = Url.find(params[:id])

SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["short_url", "aa1ab6"], ["LIMIT", 1]]
---
	def show_long_url
		#@url = Url.find_by(short_url: params[:url][:short_url])
		#Rails.cache.clear
		#puts params
		@url = Rails.cache.fetch(params[:url][:short_url], expires_in: 15.minutes) do
					Url.where(short_url: params[:url][:short_url]).first

INSERT INTO "urls" ("long_url", "url_digest", "domain", "short_url", "created_at", "updated_at", "count") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@url = Url.new(url_params)
		require 'digest/md5'
		@url.url_digest = Digest::MD5.hexdigest(params[:url][:long_url])
		@url.short_url = @url.url_digest[0,6]
		@url.count = 0
		if @url.save